Tekla Open API Reference for Tekla Structures 2025
ReinforcementBase.ReinforcementRepresentationTypes Enumeration
 The available reinforcement representation types. See Tekla Structures help, "Reinforcement appearance", for more information.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public enum ReinforcementRepresentationTypes
Public Enumeration ReinforcementRepresentationTypes
Members
Member name | Value | Description
SingleLine | 1 | A single line with radiused bends.
DoubleLine | 2 | The outline of a bar with radiused bends.
Filled | 3 | A solid bar with radiused bends.
Stick | 4 | A single line without radiused bends.
OutLine | 5 | Shows the shape of the mesh using an outline rectangle or polygon, and a diagonal line. Only applies to reinforcement meshes.
DoubleLineFilledEnds | 6 | The outline of a bar with radiused bends and filled bar ends.
SingleLineFilledEnds | 7 | A single line with radiused bends and filled bar ends.
OutlineIgnoreHoles | 8 | Shows the shape of the mesh using an outline rectangle or polygon, and a diagonal line. It ignores the holes in the meshes. Only applies to reinforcement meshes.
See Also
Reference
Tekla.Structures.Drawing Namespace